---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNotComputedWarn
source: html/bf1ee13a-ebb7-df63-be34-5080abb96183.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNotComputedWarn Property

[Family] volume can't be computed. The bounding geometry (in 3D) can't be found for [Room]. [Room] will be ignored in the energy analysis model.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomVolumeNotComputedWarn { get; }
```